Revit 2027 API
SlabShapeVertexArray.ForwardIterator Method
Retrieve a forward moving iterator to the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual SlabShapeVertexArrayIterator ForwardIterator()
Public Overridable Function ForwardIterator As SlabShapeVertexArrayIterator
public:
virtual SlabShapeVertexArrayIterator^ ForwardIterator()
abstract ForwardIterator : unit -> SlabShapeVertexArrayIterator
override ForwardIterator : unit -> SlabShapeVertexArrayIterator
Return Value
SlabShapeVertexArrayIterator
Returns a forward moving iterator to the array.
See Also
Reference
SlabShapeVertexArray Class
Autodesk.Revit.DB Namespace